; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	thermograph1 - mode
	image3 - mode
	spectrograph0 - mode
	infrared2 - mode
	GroundStation8 - direction
	Star9 - direction
	GroundStation1 - direction
	Star4 - direction
	Star2 - direction
	Star6 - direction
	Star0 - direction
	GroundStation7 - direction
	Star3 - direction
	GroundStation5 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star6)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared2)
	(supports instrument4 image3)
	(calibration_target instrument4 Star2)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 Star6)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 GroundStation7)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation7)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet14)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 Star6)
	(pointing satellite3 Phenomenon16)
	(have_image Phenomenon10 image3)
	(have_image Star11 infrared2)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 thermograph1)
	(have_image Planet14 thermograph1)
	(have_image Phenomenon15 image3)
	(have_image Phenomenon16 spectrograph0)
))

)

; plan
1. (turn_to satellite3 phenomenon16 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 phenomenon16)
   goals met: 1 of 10
2. (turn_to satellite2 star2 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 star2)
   goals met: 1 of 10
3. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 10
4. (calibrate satellite2 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 1 of 10
5. (turn_to satellite2 phenomenon13 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon13)
   goals met: 1 of 10
6. (take_image satellite2 phenomenon13 instrument4 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 2 of 10
7. (turn_to satellite2 phenomenon10 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon10)
   goals met: 2 of 10
8. (turn_to satellite0 groundstation1 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 groundstation1)
   goals met: 3 of 10
9. (take_image satellite2 phenomenon10 instrument4 image3)
   added: (have_image phenomenon10 image3)
   goals met: 4 of 10
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 10
11. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 4 of 10
12. (turn_to satellite1 phenomenon16 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon16)
   goals met: 4 of 10
13. (take_image satellite1 phenomenon16 instrument2 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 5 of 10
14. (turn_to satellite1 star6 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star6)
   goals met: 6 of 10
15. (turn_to satellite2 phenomenon15 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon15)
   goals met: 6 of 10
16. (take_image satellite2 phenomenon15 instrument4 image3)
   added: (have_image phenomenon15 image3)
   goals met: 7 of 10
17. (turn_to satellite2 planet12 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 planet12)
   goals met: 7 of 10
18. (take_image satellite2 planet12 instrument4 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 8 of 10
19. (turn_to satellite2 planet14 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet14)
   goals met: 8 of 10
20. (take_image satellite2 planet14 instrument4 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 9 of 10
21. (turn_to satellite2 star11 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 star11)
   goals met: 9 of 10
22. (take_image satellite2 star11 instrument4 infrared2)
   added: (have_image star11 infrared2)
   goals met: 10 of 10
